Admin_Panel/app/Controllers/FeaturedSections.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);
        $this->session = \Config\Services::session();
        $this->session->start();
        $this->helpers = helper('SystemSettings');
        $this->helpers = helper('News');
        date_default_timezone_set(get_system_timezone());
        $this->toDate = date('Y-m-d H:i:s');
        $this->News_Model = new News_Model();
        $this->Category_Model = new Category_Model();
        $this->BreakingNews_Model = new BreakingNews_Model();
        $this->FeaturedSections_Model = new FeaturedSections_Model();
        $this->db = \Config\Database::connect();
        $this->data['app_name'] = $this->db->table('tbl_settings')->where('type', 'app_name')->get()->getResult();
        $this->data['app_logo'] = $this->db->table('tbl_settings')->where('type', 'app_logo')->get()->getResult();
        $this->data['languages'] = $this->db->table('tbl_languages')->where('status', 1)->get()->getResult();
---
SELECT *
FROM `tbl_settings`
WHERE `type` = 'app_name'
SELECT *
FROM `tbl_settings`
WHERE `type` = 'app_logo'
SELECT *
FROM `tbl_languages`
WHERE `status` = 1

    public function get_categories_tree()
    {
        $categories = array();
        $category = array();
        $subcategories = array();
        $subcategory = array();
        $res = $this->db->table('tbl_category');
        if ($this->request->getVar('language_id')) {
            $language_id = $this->request->getVar('language_id');
            $res->where('language_id', $language_id);
        }
        $results = $res->get()->getResult();
        foreach ($results as $mainCat) {
            $results2 = $this->db->table('tbl_subcategory')->where('category_id', $mainCat->id)->get()->getResult();
---
SELECT *
FROM `tbl_category`
WHERE `language_id` = '14'
SELECT *
FROM `tbl_subcategory`
WHERE `category_id` = '5'

    public function index()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect('/');
        } else {
            $this->data['news'] = $this->News_Model->orderBy('id', 'DESC')->findAll();
            $this->data['cats'] = $this->Category_Model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `tbl_news`
ORDER BY `id` DESC
SELECT *
FROM `tbl_category`
ORDER BY `id` DESC