Admin_Panel/app/Controllers/News.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);
        $this->session = \Config\Services::session();
        $this->session->start();
        $this->helpers = helper('SystemSettings');
        date_default_timezone_set(get_system_timezone());
        $this->toDate = date('Y-m-d H:i:s');
        $this->Category_Model = new Category_Model();
        $this->Subcategory_Model = new Subcategory_Model();
        $this->Tag_Model = new Tag_Model();
        $this->News_Model = new News_Model();
        $this->UserRoles_Model = new UserRoles_Model();
        $this->db = \Config\Database::connect();
        $this->data['app_name'] = $this->db->table('tbl_settings')->where('type', 'app_name')->get()->getResult();
        $this->data['app_logo'] = $this->db->table('tbl_settings')->where('type', 'app_logo')->get()->getResult();
        $this->data['languages'] = $this->db->table('tbl_languages')->where('status', 1)->get()->getResult();
---
SELECT *
FROM `tbl_settings`
WHERE `type` = 'app_name'
SELECT *
FROM `tbl_settings`
WHERE `type` = 'app_logo'
SELECT *
FROM `tbl_languages`
WHERE `status` = 1

    public function index()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect('/');
        } else {
            $this->data['cate'] = $this->Category_Model->orderBy('id', 'DESC')->findAll();
            $this->data['tag'] = $this->Tag_Model->orderBy('id', 'DESC')->findAll();
            $this->data['user'] = $this->db->table('tbl_users')->where('name !=', '')->orderBy('name', 'ASC')->get()->getResult();
            $this->data['role'] = $this->UserRoles_Model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `tbl_category`
ORDER BY `id` DESC
SELECT *
FROM `tbl_tag`
ORDER BY `id` DESC
SELECT *
FROM `tbl_users`
WHERE `name` != ''
ORDER BY `name` ASC
SELECT *
FROM `tbl_user_roles`
ORDER BY `id` DESC

    public function get_category_by_language()
    {
        $language_id = $this->request->getVar('language_id');
        $res = $this->Category_Model->where('language_id', $language_id)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `tbl_category`
WHERE `language_id` = '14'
ORDER BY `id` DESC

    public function get_subcategory_by_category()
    {
        $category_id = $this->request->getVar('category_id');
        $res = $this->Subcategory_Model->where('category_id', $category_id)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `tbl_subcategory`
WHERE `category_id` = '17'
ORDER BY `id` DESC

    public function get_tag_by_language()
    {
        $language_id = $this->request->getVar('language_id');
        $res = $this->Tag_Model->where('language_id', $language_id)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `tbl_tag`
WHERE `language_id` = '2'
ORDER BY `id` DESC

                    'show_till'      => ($this->request->getVar('show_till')) ? $this->request->getVar('show_till') : '',
                    'language_id'    => $this->request->getVar('language'),
                ];
                $this->News_Model->insert($data);
---
INSERT INTO `tbl_news` (`category_id`, `subcategory_id`, `tag_id`, `title`, `date`, `content_type`, `content_value`, `description`, `image`, `admin_id`, `status`, `show_till`, `language_id`) VALUES ('13', 0, '', 'aa', '2023-08-04 23:14:56', 'standard_post', '', '<p>aa</p>', '1691171096.4134.png', '1', '1', '', '14')

    public function send_notification($fcmMsg) {
        $data = $this->db->table('tbl_settings')->where('type', 'fcm_sever_key')->get()->getResult();
        define('API_ACCESS_KEY', $data[0]->message);

        $devicetoken1 = array();
        $devicetoken = $this->db->table('tbl_token')->get()->getResult();
---
SELECT *
FROM `tbl_settings`
WHERE `type` = 'fcm_sever_key'
SELECT *
FROM `tbl_token`