Admin_Panel/app/Controllers/Table.php

SELECT COUNT(id) as total
FROM `tbl_news_view`
WHERE `news_id` = '190'
SELECT COUNT(id) as total
FROM `tbl_news_like`
WHERE `news_id` = '190'
---
            } else {
                $con_value = "";
            }
            $views = $this->db->table('tbl_news_view')->select('COUNT(id) as total')->where('news_id', $row->id)->get()->getResult();
            $row->total_views = (!empty($views)) ? $views[0]->total : "0";
            $likes = $this->db->table('tbl_news_like')->select('COUNT(id) as total')->where('news_id', $row->id)->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `tbl_news_image`
WHERE `news_id` = '190'
---
            $operate .= '<a class="btn btn-icon btn-sm btn-primary text-white edit-data" data-id=' . $row->id . ' data-toggle="modal" data-target="#editDataModal" title="Edit"><em class="fa fa-edit"></em></a>&nbsp;&nbsp;';
            $operate .= '<a class="btn btn-icon btn-sm btn-danger text-white delete-data" data-id=' . $row->id . ' data-image="' . $image . '" data-cvalue="' . $con_v . '" title="Delete"><em class="fa fa-trash"></em></a>&nbsp;&nbsp;';
            $operate .= '<a class="btn btn-icon btn-sm btn-info text-white clone-data" data-id=' . $row->id . ' data-image="' . $image . '" data-cvalue="' . $con_v . '" title="Clone News"><em class="fa fa-clone"></em></a>';
            $total_image = $this->db->table('tbl_news_image')->where('news_id', $row->id)->countAllResults();